Repository: 84000/data-translation-memory
Catalog: toh263-v3.tmx
Source language: bo
Languages: en

source: ཐེག་པ་གསུམ་གྱིས་ལུང་བསྟན་པར་བྱ་བ་འདི་ནི་བཅོམ་ལྡན་འདས་བདག་གི་སྨོན་ལམ་དུ་གྱུར་ཏོ། །
en: Respected Blessed One, those were my aspirations.

source: གང་གི་ཚེ་བདག་སངས་རྒྱས་ཀྱི་སྤྱན་སྔར་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཤིང་ཆོས་སྨྲ་བའི་མདུན་དུ་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ་དེ་ལྟ་བུའི་སྨོན་ལམ་བཏབ་པས་བདག་སྔོན་གྱི་མཐའི་མུ་ནས་བཟུང་སྟེ། ཉིན་མཚན་མེད་པ་ཇི་ཙམ་པ་སེམས་ཅན་རྣམས་ལས་སེམས་ཅན་རེ་རེ་ལ་ཡང་དེ་ཙམ་གྱི་ངན་འགྲོ་གསུམ་སྒྲུབ་པའི་ལས་ཀྱི་སྒྲིབ་པ་མ་ལུས་པར་ཟད་པར་གྱུར་ཅིག །
en: “When I knelt on my right knee before the Buddha, and knelt on my right knee before the Dharma reciters, I made these aspirations: ‘May all the karmic hindrances that bring about the three lower realms be extinguished for each and every being as numerous as all the countless days and nights that I have lived throughout the past!

source: གང་ཕ་རོལ་ལ་སྐྱེད་པར་འགྱུར་བ་བདེ་འགྲོ་གསུམ་ལ་ཉོན་མོངས་པ་མེད་པར་འགྱུར་བ་ནས་བླ་ན་མེད་པར་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་བར་དུ་ངན་འགྲོར་སྐྱེ་བར་མ་གྱུར་ཅིག །
en: May those beings be reborn devoid of afflictions in the three higher realms and may they never be born again in the lower realms for as long as it takes them to pass into unsurpassed, complete nirvāṇa!

source: གང་ཡང་བདག་གིས་སྔོན་གྱི་མཐའི་མུ་ནས་བཟུང་སྟེ། ངན་འགྲོ་གསུམ་སྒྲུབ་པའི་ལས་མངོན་པར་འདུས་བྱས་པ་འདོར་བ་མེད་པ་མ་ལུས་པར་ཟད་པར་གྱུར་ཅིག །
en: May all the actions that bring about the three lower realms that I have accumulated and not discarded in the past be extinguished!

source: སྨོན་ལམ་གཞན་གྱི་དབང་གིས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་བླ་ན་མེད་པར་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་བར་དུ་ངན་འགྲོ་གསུམ་གྱི་ངན་འགྲོར་སྐྱེ་བར་མི་བྱའོ། །
en: In order to ripen beings, may I, through the power of those different aspirations, never be born in the three lower realms for as long as it takes for me to pass into unsurpassed complete, nirvāṇa!

source: གང་གི་ཚེ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱ་བ་དེའི་ཚེ། སེམས་ཅན་རྣམས་ངན་འགྲོ་གསུམ་ལས་ཡོངས་སུ་ཐར་བར་བྱ་བའི་ཕྱིར་སྐྱབས་གསུམ་ལས་རྣམ་པར་དགོད་པར་བྱ་བ་འདི་ནི་བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་གི་སྨོན་ལམ་དུ་གྱུར་ཏོ། །
en: Once I awaken to unsurpassed and perfect buddhahood, I will establish beings in the threefold refuge in order to liberate them from the three lower realms!’

source: གང་གི་ཚེ་བདག་སངས་རྒྱས་དང་།
en: Respected Blessed One, those were my aspirations.

source: ཆོས་དང་། དགེ་འདུན་ལ་ཡན་ལག་ལྔས་ཕྱག་འཚལ་བར་བྱེད་པ་དེ་བཞིན་དུ་ཡང་བདག་གིས་སྨོན་ལམ་བཏབ་བོ། །ཕྱོགས་བཅུའི་སའི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་འདི་རེ་རེ་ལ་ཡང་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་ཇི་ཙམ་པ་ལྟར་ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་དང་།
en: “When I did a full-length prostration to the Buddha, the Dharma, and the Saṅgha, I made these aspirations: ‘May all karmic formations from the causal factors of ignorance up to old age and death, which each and every being as numerous as the tiniest boundless and infinite particles of the earth element throughout the ten directions as well as the elements of water, fire, wind, and consciousness has accumulated in the past, be extinguished!

source: རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱང་དེ་བཞིན་ཏེ། སེམས་ཅན་ཐམས་ཅད་ལས་སེམས་ཅན་རེ་རེ་ལ་ཡང་སྔོན་གྱི་མཐའི་མུ་ནས་བཟུང་སྟེ། མ་རིག་པའི་རྒྱུ་ནས་རྒ་ཤིའི་རྒྱུའི་བར་དུ་ལས་ཀྱི་མངོན་པར་འདུ་བྱེད་པ་མངོན་པར་འདུས་བྱས་ཤིང་འདོར་བ་མེད་པར་འགྱུར་བ་མ་ལུས་པར་ཟད་པར་གྱུར་ཅིག །སེམས་ཅན་རེ་རེ་ལ་ཡང་དེ་ཙམ་གྱི་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་ཆོས་ཀྱི་སྒོའི་ཚུལ་ཤེས་པ་དེ་ཆོས་ལ་སུ་ཡང་བླ་ན་མེད་པར་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་བར་དུ་མ་བརྗེད་ཅིག །
en: For as long as it takes them to pass into unsurpassed, complete nirvāṇa, may none of those who know the manner of the gateway to the Dharma of dependent arising ever forget that Dharma teaching!

source: གང་ཡང་བདག་གིས་སྔོན་གྱི་མཐའི་མུ་ནས་བཟུང་སྟེ། མ་རིག་པའི་རྒྱུ་ནས་རྒ་ཤིའི་རྒྱུའི་བར་དུ་དེ་ཙམ་གྱི་ལས་ཀྱི་མངོན་པར་འདུ་བྱེད་པ་མངོན་པར་འདུས་བྱས་པར་གྱུར་པ་མ་ལུས་པར་ཡོངས་སུ་ཟད་པར་གྱུར་ཅིག །
en: May all the karmic formations from the causal factor of ignorance up to the causal factor of old age and death that I have accumulated in the past be completely extinguished!

source: ཡང་བླ་ན་མེད་པའི་ཡེ་ཤེས་ཆེན་པོ་ཐོབ་པར་བྱ་བའི་བར་གྱི་ཕྱིར་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་ཆོས་ཀྱི་ཤེས་པར་བྱ་བ་དྲན་པར་བྱའོ། །
en: I will remember this Dharma topic that is dependent arising in order to attain unsurpassed great wisdom.

source: སེམས་ཅན་ཐམས་ཅད་ལས་སེམས་ཅན་རེ་རེ་ལ་ཡང་དེ་ཙམ་གྱི་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་ཆོས་ལ་འཇུག་པར་བྱ་བ་འདི་ནི་བཅོམ་ལྡན་འདས་བདག་གི་སྨོན་ལམ་དུ་གྱུར་ཏོ། །
en: Respected Blessed One, those were my aspirations.

source: གང་གི་ཚེ་བདག་སངས་རྒྱས་དང་ཆོས་སྨྲ་བའི་སྤྱན་སྔར་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། ལག་པ་གཉིས་ཐལ་མོ་སྦྱར་ནས་མཆོག་ཏུ་དགའ་བའི་མིག་དང་། བཞིན་དང་། དབང་པོ་ཐམས་ཅད་གཅིག་ཏུ་འདུས་པས་སྦྱིན་པའི་གནས་དེ་ལ་རྟག་ཏུ་མཆོད་པར་བྱ་བའི་ཕྱིར་ཉེ་བར་ཕྱིན་ཏེ་བདག་ཉིད་ཀྱི་ལུས་ཀྱི་བ་སྤུའི་ཁུང་བུ་ཇི་ཙམ་པ་དང་།
en: “After I knelt on my right knee before the Buddha and the Dharma reciters, I placed my palms together and approached those worthy recipients of generosity with my eyes and face expressing supreme joy.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་བ་སྤུའི་ཁུང་བུར་གྱུར་པ་ཇི་ཙམ་པ་དེ་ཙམ་གྱི་སེམས་ཅན་ཐམས་ཅད་ལས་སེམས་ཅན་རེ་རེ་ཞིང་ཡང་དེ་ཙམ་གྱི་ལས་ཀྱི་འབྲས་བུ་ཐམས་ཅད་ཟད་པར་གྱུར་ཅིག །
en: With all my senses focused on worshiping them, I made the following aspiration: ‘May all the karmic results of all beings as numerous as all the pores on my body and on the bodies of all beings be extinguished!

source: ཉོན་མོངས་པའི་དྲི་མ་ཐམས་ཅད་སྤངས་པར་གྱུར་ཅིག །
en: May they abandon all the stains of their afflictions!

source: གཏི་མུག་གི་དྲི་མ་ཐམས་ཅད་སྤངས་པར་གྱུར་ཅིག །
en: May they abandon all the stains of their delusion!

source: ཡེ་ཤེས་ཀྱི་དྲི་མ་ཐམས་ཅད་སེལ་བར་གྱུར་ཅིག །
en: May they clear away all the stains that hinder their wisdom!

source: སེམས་ཅན་རེ་རེ་ལ་ཡང་དེ་ཙམ་གྱི་བསོད་ནམས་ཀྱིས་ཡང་དག་པར་བརྒྱན་པར་གྱུར་ཅིག །
en: May every being be perfectly adorned with merit!

source: སེམས་ཅན་རེ་རེ་ལ་ཡང་དེ་ཙམ་གྱི་འཁོར་བ་བརྒྱ་སྟོང་གྲངས་མེད་པ་ཕྱིར་ཕྱོགས་པར་གྱུར་ཅིག །
en: May they turn away from the countless hundreds of thousands of existences in saṃsāra!

source: སེམས་ཅན་རེ་རེ་ལ་ཡང་དེ་ཙམ་གྱི་རྫུ་འཕྲུལ་གྱི་ཡུལ་ལ་ཏིང་ངེ་འཛིན་གྱི་སྒོ་སྒྲུབ་པ་རྣམ་པར་རྩེ་བར་གྱུར་ཅིག །
en: May they revel in the accomplishment of the gateway to the absorptions that are the domain of miraculous power!

source: སེམས་ཅན་རེ་རེ་ལ་ཡང་དེ་ཙམ་གྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་བསྙེན་བཀུར་བར་གྱུར་ཅིག །
en: May they serve the blessed buddhas!

source: སངས་རྒྱས་རེ་རེ་ལ་ཡང་ཆོས་ཀྱི་སྒོ་བརྒྱ་སྟོང་འཇུག་པར་གྱུར་ཅིག །
en: May they enter a hundred thousand gateways to the Dharma of the buddhas!

source: སངས་རྒྱས་རེ་རེའི་སྤྱན་སྔར་ཡང་དེ་ཙམ་གྱི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་ཚོགས་ཀྱི་སྨོན་ལམ་དག་འཛིན་པར་གྱུར་ཅིག །
en: May they hold on to their aspirations to amass the virtuous qualities of the buddha realms made in the presence of each buddha!

source: སེམས་ཅན་རེ་རེ་ལ་ཡང་སེམས་ཅན་རེ་རེས་དེ་ཙམ་གྱི་དགེ་བའི་རྩ་བ་ལ་སྦྱོར་བར་གྱུར་ཅིག་སེམས་ཅན་རེ་རེ་ཞིང་ཡང་གཅིག་ལ་གཅིག་དེ་ཙམ་གྱི་དགའ་བ་དང་། ཡིད་བདེ་བ་ཐོབ་པར་གྱུར་ཅིག །
en: May each and every being come to possess the roots of virtue! May they experience joy and happiness in relation to each other!

source: སེམས་ཅན་རྣམས་རེ་རེ་ལ་ཡང་དེ་ཙམ་གྱི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་གྱི་ཚོགས་ལས་སངས་རྒྱས་ཀྱི་ཞིང་ཕུན་སུམ་ཚོགས་པར་གྱུར་ཅིག །
en: May their buddha realms be perfected due to amassing the virtuous qualities of the buddha realms!

source: སེམས་ཅན་རེ་རེ་ལ་ཡང་སྲིད་པར་སྐྱེ་བ་མ་ལུས་པར་སྤངས་པར་གྱུར་ཅིག །སེམས་ཅན་ཐམས་ཅད་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་གྱུར་ཅིག །
en: May all beings abandon all rebirths in cyclic existence, and may they swiftly awaken to unsurpassed and perfect buddhahood!

source: དེ་ཙམ་གྱི་བདག་གི་ལས་ཀྱི་སྟོབས་ཟད་པར་གྱུར་ཅིག །
en: May the power of my karma also be extinguished!

source: དེ་ཙམ་གྱི་ཉོན་མོངས་པའི་དྲི་མ་བྱང་བར་གྱུར་ཅིག །
en: May the stains of my afflictions be purified!

source: བདག་གིས་དེ་ཙམ་གྱི་ཆུ་བོའི་སྟོབས་ཉམས་པར་གྱུར་ཅིག །
en: May the power of the floods decline!

source: བདག་གིས་དེ་ཙམ་གྱི་ཡེ་ཤེས་ཀྱི་སྟོབས་ཉམས་པ་མེད་པར་གྱུར་ཅིག །
en: May the power of my wisdom never decline!

source: བདག་གིས་དེ་ཙམ་གྱི་བསོད་ནམས་དང་བསོད་ནམས་ཀྱི་མཛོད་དུ་གྱུར་ཅིག །
en: May my merit become a treasury of merit!

source: བདག་གིས་དེ་ཙམ་གྱི་འཁོར་བ་བརྒྱ་སྟོང་གྲངས་མེད་པའི་ཕྱི་ཕྱོགས་སུ་གྱུར་ཅིག །
en: May I turn away from the countless hundreds of thousands of existences in saṃsāra!

source: དེ་ཙམ་གྱི་རྫུ་འཕྲུལ་གྱི་ཡུལ་ལ་ཏིང་ངེ་འཛིན་གྱི་སྒོ་སྒྲུབ་པ་རྣམ་པར་ཕྱེ་བར་གྱུར་ཅིག །
en: May I accomplish and open the gateway to absorption that is the domain of miraculous power!

source: ཡུད་ཙམ་གྱིས་ན་དེ་ཙམ་གྱི་ཕྱོགས་བཅུའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་ལ་བསྙེན་བཀུར་བར་བྱའོ། །
en: Every moment, I will serve the blessed buddhas who reside in and preside over the ten directions.

source: སངས་རྒྱས་རེ་རེ་ལས་ཀྱང་དེ་ཙམ་གྱི་ཆོས་ཀྱི་སྒོ་སྟོང་ལ་འཇུག་པར་བྱའོ། །
en: I will enter the thousands of gateways to the Dharma of each of those buddhas.

source: སེམས་ཅན་རེ་རེ་ལའང་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་དེ་ཙམ་གྱི་དགེ་བའི་རྩ་བས་བརྒྱན་པར་བྱའོ། །
en: I will adorn all beings with roots of virtue.

source: སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་བདག་ཀྱང་ལུས་དང་ངག་དང་ཡིད་དེ་ཙམ་གྱི་སྙན་པ་དང་། དགའ་བར་བྱ་བའི་དགེ་བའི་རྩ་བས་བརྒྱན་པར་གྱུར་ཅིག །
en: In order to ripen all beings, may I also be adorned with roots of virtue that cause me to have delightful and pleasing physical, verbal, and mental qualities!

source: སེམས་ཅན་དེ་དང་བདག་ལྷན་ཅིག་ཏུ་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་སྤྱོད་པ་ན། བདག་གིས་བརྗོད་པ་ཙམ་གྱིས་ཀྱང་སེམས་ཅན་དེ་དག་གི་དེ་ཙམ་གྱི་སྲིད་པ་སྐྱེ་བ་མ་ལུས་པར་ཟད་པར་བྱའོ། །
en: When I and all beings practice the conduct of awakening together, I will, through mere words, bring an end to all those beings’ rebirths.

source: དེ་ཙམ་གྱི་ལྟ་བ་ལོག་པའི་རྙོག་པ་འདི་རབ་ཏུ་ཞི་བར་བྱའོ། །དེ་ཙམ་གྱི་ཉོན་མོངས་པའི་ནད་འདི་རབ་ཏུ་ཞི་བར་བྱའོ། །
en: I will calm the turbid waters of their mistaken views, and I will heal the diseases of their afflictions.

source: དེ་ཙམ་གྱི་སེམས་ཅན་ལུས་དང་།
en: My words will cure the lack of affection of beings whose bodies, concentrations, and faculties are impaired.

source: བསམ་གཏན་དང་། དབང་པོ་མ་ཚང་བ་ཚིག་གིས་སྙིང་རིང་བ་རབ་ཏུ་ཞི་བར་བྱ་བ་གཅིག་བརྗོད་པ་ཙམ་གྱིས་ན། སེམས་ཅན་ཐམས་ཅད་ལས་སེམས་ཅན་རེ་རེ་ཞིང་། དེ་ཙམ་གྱི་སྦྱིན་པ་དགེ་བའི་རྩ་བ་ལ་དགོད་པར་བྱ་བ་ནས་ཤེས་རབ་ཀྱི་བར་དུ་དགེ་བའི་རྩ་བ་ལ་དགོད་པར་བྱའོ། །
en: With a single word, I will establish them in everything from the roots of virtue related to generosity to the roots of virtue related to insight.

source: བདག་དང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བ་སྤུའི་ཁུང་བུ་ཇི་ཙམ་དུ་གྱུར་པ་བདག་གིས་གཅིག་བརྗོད་པས་དེ་ཙམ་གྱི་སེམས་ཅན་ཐམས་ཅད་ལས་སེམས་ཅན་རེ་རེ་ཞིང་སྦྱིན་པའི་དགེ་བའི་རྩ་བ་ལ་དགོད་པར་བྱ་བ་འདི་ནི་བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་གི་སྨོན་ལམ་དུ་གྱུར་ཏོ། །གང་གི་ཚེ་བདག་ཟས་དང་། སྐོམ་གྱིས་སངས་རྒྱས་སམ། ཆོས་སྨྲ་བའམ།
en: With a single word, I will establish all the beings as numerous as all the pores on my body and on the bodies of everyone else in the roots of virtue related to generosity.’

source: དགེ་སློང་གི་དགེ་འདུན་ནམ། དགེ་སློང་གཅིག་གམ། དགེ་སློང་མ་གཅིག་གམ། དགེ་བསྙེན་ཕའམ།
en: Respected Blessed One, those were my aspirations.

source: དགེ་བསྙེན་མའམ། ཕའམ། མའམ། ཕྱི་རོལ་གྱི་དྲང་སྲོང་ངམ། ལ་ལ་རིགས་ཀུན་ནས་བསྙེན་བཀུར་བའི་མིར་གྱུར་པ་ལ་སྟོབས་ཤིང་། ཆུང་ངུ་ན་བྱོལ་སོང་གི་སྐྱེ་གནས་སུ་སོང་བ་ལ་ཡང་ཟས་དང་སྐོམ་བྲིམ་པར་བྱ་བ་དེ་བཞིན་དུ་ཡང་སྨོན་ལམ་བཏབ་པ་ནས་སེམས་ཅན་འདུལ་བ་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་བར་གྱི་ཕྱིར་བདག་ཡུན་རིང་པོར་འཁོར་བ་ན་འཁོར་བར་བྱའོ། །
en: “At that time, I also made the following aspiration to have the power to be the person who serves food and drinks to the Buddha, the Dharma reciters, the Saṅgha of monks, the solitary monks, the solitary nuns, the male and female lay practitioners, the men, the women, the sages of other traditions, and all human beings from all castes, and even to distribute food and drinks to all the beings born in the animal realm: ‘I will continue to circle in saṃsāra in order to tame and ripen beings!

source: གང་ཆུང་ངུ་ན་སྐྲའི་ཉག་མ་གཅིག་ཙམ་གྱི་ཟས་དང་སྐོམ་ཡང་ཡོངས་སུ་ལེན་ཏོ། །
en: I will only accept food and drinks in amounts as small as the size of a single hair!

source: སེམས་ཅན་བརྒྱ་སྟོང་ནས་ཆུ་བོ་གང་གཱའི་བྱེ་མ་ཙམ་པོ་ཟས་དང་སྐོམ་འདོད་པ་ཡང་དག་པར་ལྷགས་པ་བདག་གི་གན་དུ་ཉེ་བར་འོངས་པ་ཇི་ཙམ་པ་དང་། ཁ་དོག་གིས་འདོད་པ་ཇི་ཙམ་པ་དེ་ཙམ་པ་དང་། རོ་ཇི་ཙམ་གྱིས་དོན་ཇི་ལྟར་འདོད་པ་དེ་ཙམ་གྱི་ཕུན་སུམ་ཚོགས་པར་འདོད་དོ། །
en: The entire assembly of hundreds of thousands of beings—those as numerous as all the grains of sand in the Ganges—who come to me and want food and drink will enjoy in abundance all the food and drink of any color or flavor they want.

source: གལ་ཏེ་ཁ་དོག་དམར་པོ་གཅིག་དང་། སྐྱ་བོ་གཉིས་འདོད་པ་ནས་ཁ་དོག་སྟོང་ཕྲག་བརྒྱད་ཅུ་གཅིག་ལ་གཅིག་འདོད་པ་དེ་ཙམ་གྱི་ཕུན་སུམ་ཚོགས་པར་འགྱུར་ཞིང་། གཅིག་ལ་གཅིག་ཉམས་པ་མེད་པར་འགྱུར་རོ། །
en: Whether they want anything from a single red color or two pale colors to eighty thousand different colors, each of them will enjoy exactly what they wish for in abundance, and those colors and flavors will not weaken one another.

source: བདག་ནི་སེམས་ཅན་དེ་དག་ཇི་ཙམ་པ་དེ་ཙམ་གྱི་ཟས་དང་སྐོམ་ཟད་པ་མེད་པ་ཇི་ཙམ་འདོད་པ་བྲིམ་པར་བྱའོ། །
en: I will distribute inexhaustible amounts of any food and drink those beings want.

source: གང་བདག་གི་ལག་ནས་ཟས་དང་སྐོམ་བླངས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་ལུས་ཀྱི་ནད་རབ་ཏུ་ཞི་བར་འགྱུར་རོ། །
en: The food and drink that they take from my hand will completely cure all of their physical illnesses.

source: གང་ཡང་ཟས་དང་སྐོམ་དེ་ཡོངས་སུ་ཟོས་པ་དེ་ཐམས་ཅད་ཀྱི་ཡིད་ཀྱི་ནད་རབ་ཏུ་ཞི་བར་འགྱུར་རོ། །
en: The food and drink they consume will completely cure their mental illnesses.

source: སྡིག་པའི་ལྟ་བ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་འགྱུར་རོ། །འགྲོ་བ་ཐམས་ཅད་ལ་སེམས་ཅན་གྱི་མངལ་གྱི་གནས་རྒྱུན་གཅོད་པར་བྱ་བ་ནས།
en: It will pacify all their unwholesome views, and accomplish everything including ending the stream of rebirths for all those beings.

source: གང་བདག་གི་ཟས་དང་སྐོམ་ཟོས་ཤིང་། དེ་བཞིན་དུ་གོས་དང་། མལ་སྟན་དང་། མེ་ཏོག་དང་། ཕྲེང་བ་དང་།
en: May anyone who consumes my food and drink, or accepts any clothes, bedding, flowers, garlands, ointments, medicine, dwelling places, servants, or even a single piece of the point of one of my hairs that I offer to them, be completely liberated from rebirth for as long as it takes for them to pass into unsurpassed nirvāṇa!

source: བྱུག་པ་དང་། སྨན་དང་། གནས་དང་། ནད་གཡོག་དང་།
en: May I cause all disciples to pass into nirvāṇa!’

source: ཆུང་ངུ་ན་སྐྲའི་རྩེ་མོའི་ཆ་ཙམ་གྱི་བར་དུ་བདག་གིས་གཞན་ལ་བྱིན་པ་གང་གིས་བླངས་པ་དེའི་མངལ་གྱི་གནས་ཇི་ཙམ་པ་ཐམས་ཅད་ལས་བླ་ན་མེད་པར་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་བར་དུ་ཡོངས་སུ་ཐར་བར་འགྱུར་ཞིང་བདག་གིས་འདུལ་བ་ཐམས་ཅད་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་གྱུར་ཅིག་པ་འདི་ནི་བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་གི་སྨོན་ལམ་དུ་གྱུར་ཏོ། །
en: Respected Blessed One, those were my aspirations.

source: གང་གི་ཚེ་ཡང་ཉོན་མོངས་པ་དང་རྙོག་པ་ལྔའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་བདག་འཁོར་བ་ན་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་སྤྱོད་པར་བྱ་ཞིང་སེམས་ཅན་རྣམས་དམའ་བར་སྤྱོད་པ་ལས་ཡོངས་སུ་ཐར་བར་བྱ་བ་དེའི་ཚེ་ཉོན་མོངས་པ་དང་།
en: “ ‘As I cycle through afflicted buddha realms inundated with the five impurities, I will practice the conduct of awakening and liberate beings from inferior forms of conduct.

source: རྙོག་པ་ལྔའི་སངས་རྒྱས་ཀྱི་ཞིང་སོ་སོར་བདག་སྤྱོད་པ་དང་། དཀའ་ཐུབ་དང་། བརྟུལ་ཞུགས་ཡང་དག་པར་སྤྱོད་པ་བསླབ་པར་བྱའོ། །
en: At that time, I will practice in each of those afflicted buddha realms inundated with the five impurities, and I will train in and perform ascetic practices and observances.

source: གང་གི་ཚེ་དགའ་ལྡན་གྱི་ཁང་པ་ན་བདག་སྐྱེ་བ་གཅིག་གིས་ཐོགས་ནས་མི་བཟད་པའི་སྤྱོད་ལམ་དང་། མི་བཟད་པའི་བརྟུལ་ཞུགས་དང་། མི་བཟད་པའི་དཀའ་བ་ཡང་དག་པར་སྤྱོད་པས་བརྩོན་འགྲུས་བརྟན་པ་ལ་ཡི་དམ་དུ་སྤྱད་པར་བྱའོ། །
en: I will spend one life in the palace of the heaven of Tuṣita, where I will practice with a firm commitment to diligence while engaging in intense physical activities, observances, and austerities.

source: ཇི་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནས་སའི་རོ་ཐིགས་པའི་བག་ཆགས་ཞེས་བྱ་བས་ལ་བུ་ག་ཙམ་ཡང་བྲལ་བ་མེད་པར་འབྱུང་བས་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་གང་སེམས་ཅན་ཤ་ཟ་བདེ་རྨའི་མཚན་མས་ས་རྐོའོ། །
en: In that buddha realm there is ‘earth infused with delicious morsels’ and the ground is devoid of and lacking even the smallest holes. The beings who eat meat and are marked by sores dig the earth in that buddha realm.

source: ཤ་ཡོངས་སུ་སྤངས་པས་སའི་རོ་ཐིགས་པའི་བག་ཆགས་དེ་ཟོས་ནས་ཤིན་ཏུ་ཞིམ་ཞིང་དྲི་ཤིན་ཏུ་ཞིམ་པ་སྟོང་དུ་འགྱུར་བ།
en: After they give up meat, they eat that earth infused with delicious morsels and enjoy a thousand delicious flavors and aromas.

source: གང་གི་ཕྱིར་འདོད་པ་དང་། གང་ལ་འདོད་པ་དང་། ཇི་ཙམ་གྱི་ཕྱིར་འདོད་པ་དེ་ལྟར་ཐོབ་པར་འགྱུར་རོ། །
en: In that way, they obtain it however they want, whenever they want, and in any quantity they want.

source: གང་ཡང་སའི་རོ་ཐིགས་པའི་བག་ཆགས་དེ་ཡོངས་སུ་ཟོས་ཤིང་གང་ཆུང་ངུ་ན་བྱ་དང་རི་དགས་ཀྱིས་ཀྱང་ཟོས་པས་དེ་དག་ཐམས་ཅད་ཀྱི་ལུས་ཀྱི་གནས་ངན་ལེན་དང་། ངག་གི་གནས་ངན་ལེན་དང་། ཡིད་ཀྱི་གནས་ངན་ལེན་དང་། ཉོན་མོངས་པའི་བག་ཆགས་ཀྱི་རྗེས་ཀྱི་མཚམས་ཀྱང་ཐམས་ཅད་ཀྱིས་ཐམས་ཅད་ཀྱི་རྒྱུན་བཅད་པར་འགྱུར་རོ། །
en: All the physical, verbal, and mental negative tendencies, as well as all the latent patterns of the afflictions, of all those who eat that earth infused with delicious morsels, even those of the smallest birds and the wild animals who eat it, are completely eliminated.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ན་ལ་ལ་ཤ་ཡོངས་སུ་མི་ཟ་ཞིང་ཆུང་ངུ་ན་བྱ་དང་རི་དགས་ཀྱིས་ཀྱང་ཁྲག་མི་འཐུང་བར་འགྱུར་བ་དེ་དག་གི་ཤིང་རོ་ཧི་ནི་རྣམ་པར་རྒྱལ་བ་ཞེས་བྱ་བ་བྱུང་བར་གྱུར་ཏོ། །གང་དེའི་ལོ་མ་དང་། ལྕུག་མ་དང་། ཡལ་ག་བཅད་པ་དེ་ལས་ཁྲག་ཁ་དོག་དང་ལྡན་པ།
en: There are trees called Victorious Rohiṇī that grow in all of the buddha fields where beings do not eat meat and even the smallest birds and wild animals do not drink blood.

source: དྲི་དང་ལྡན་པ། རོ་དང་ལྡན་པ་འབྱུང་བར་འགྱུར་བ་ལ་ཆུང་ངུ་ན་བྱ་དང་རི་དགས་ཀྱིས་ཀྱང་ཁྲག་འཐུངས་པས་དེ་དག་གི་ལུས་ཀྱི་གནས་ངན་ལེན་དང་། ངག་གི་གནས་ངན་ལེན་དང་། ཡིད་ཀྱི་གནས་ངན་ལེན་དང་། ཉོན་མོངས་པའི་བག་ཆགས་ཀྱི་མཚམས་ཐམས་ཅད་ཐམས་ཅད་ཀྱིས་ཐམས་ཅད་ཀྱི་རྒྱུན་བཅད་པར་འགྱུར་གྱི།
en: When the leaves, twigs, and branches of those trees are cut, colorful, fragrant, and tasty blood flows out, and even when the small birds and wild animals drink that blood, all their physical, verbal, and mental negative tendencies, as well as all the habitual tendencies of their afflictions are completely eliminated.

source: ཇི་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ཐམས་ཅད་ན་ལ་ལ་ཁྲག་མི་འཐུང་ན་ནི་ཆུང་ངུ་ན་བྱ་དང་རི་དགས་ཀྱིས་ཀྱང་འཐུང་བར་མི་འགྱུར་རོ། །
en: But since no one drinks blood in that entire buddha realm, even the smallest birds and the wild animals do not drink it.

source: གང་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་འོ་མ་འཐུང་བར་འདོད་པ་དེ་དག་གི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་ཤིང་རྡུལ་དང་བྲལ་བ་དེ་སྐྱེ་བར་འགྱུར་རོ། །
en: Immaculate trees grow in that buddha realm for those who want to drink milk.

source: སངས་རྒྱས་ཀྱི་ཞིང་གང་ན་འོ་མ་འཐུང་བར་འདོད་པ་དེ་ཤིང་དེའི་ལོ་མའམ། ལྕུག་མའམ། ཡལ་ག་བཅད་པ་དེ་ལས་འོ་མ་མཆོག་ཏུ་གསལ་བ། ཁ་དོག་དང་ལྡན་པ། དྲི་དང་ལྡན་པ།
en: When their leaves, twigs, and branches are cut, extremely clear, colorful, fragrant, and tasty milk flows out for those who want to drink milk.

source: རོ་དང་ལྡན་པར་འབྱུང་བར་འགྱུར་བ་དེ་ལ་གང་བྱ་དང་རི་དགས་ཀྱི་བར་དུ་ཡོངས་སུ་འཐུངས་པས་དེའི་ལུས་ཀྱི་གནས་ངན་ལེན་དང་། ངག་གི་གནས་ངན་ལེན་དང་། ཡིད་ཀྱི་གནས་ངན་ལེན་དང་། ཉོན་མོངས་པའི་བག་ཆགས་ཀྱི་མཚམས་ཐམས་ཅད་ཐམས་ཅད་ཀྱིས་ཐམས་ཅད་ཀྱི་རྒྱུན་བཅད་པར་འགྱུར་གྱི།
en: When beings, including birds and wild animals, drink that milk, all their physical, verbal, and mental negative tendencies, as well as all the habitual tendencies of their afflictions, are completely eliminated.

source: ཇི་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ཐམས་ཅད་ལ་ལ་ཤིང་གི་འོ་མ་དེ་མ་གཏོགས་པར་འོ་མ་གཞན་ནི་ཡོངས་སུ་མི་མཐོང་ངོ་། །
en: There is no milk in that entire buddha realm aside from the milk of those trees.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་ཆུའི་རྫིང་དུ་སེམས་ཅན་སྐྱེའི་མངལ་གྱི་གནས་ནི་མ་ཡིན་ནོ། །
en: In that buddha realm, beings are born in water ponds and there are no womb births.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེར་སེམས་ཅན་དམྱལ་བ་ཐམས་ཅད་དང་།
en: In that buddha realm, beings are free from all the hell realms and the world of the Lord of Death.

source: གཤིན་རྗེའི་འཇིག་རྟེན་རྒྱུན་ཆད་པར་གྱུར་པ་དེ་ཙམ་ན་དགའ་ལྡན་ན་མི་བཟད་པའི་བརྟུལ་ཞུགས་དང་། ཡང་དག་པར་སྤྱོད་པའི་ཡི་དམ་གྱིས་ཡང་དག་པར་སྤྱད་པར་བྱའོ། །
en: “ ‘At that time, I will make it my personal commitment to practice intense observances and perfect conduct in Tuṣita.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་ཇི་ལྟར་བུད་མེད་ཡོངས་སུ་དག་པའི་སེམས་ཀྱི་མཐའ་དང་ལྡན་པ་ཐོབ་པར་བྱ་བའི་ཕྱིར་བུད་མེད་ཀྱི་ཕྲག་དོག་དང་། འཇུངས་པའི་གནས་སུ་གྱུར་པ་དང་། སླུ་བའི་ལས་ཀྱི་གནས་ཡོངས་སུ་ཟད་པར་འགྱུར་རོ། །
en: Since the women in that buddha realm have developed completely pure attitudes, all their envy, stinginess, and deception are completely extinguished.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་བུད་མེད་ཀྱི་ལུས་ཐོབ་པར་འགྱུར་བ་དེ་ལ་སེམས་ཅན་འཁྲིག་པའི་ཆོས་བྲལ་བར་གྱུར་ཅིང་། ཐབ་མོ་དང་། འཁྲུག་པ་དང་། བརྫུན་དུ་སྨྲ་བ་དང་། བརྫུན་དང་། ཕྲ་མ་དང་། ཞེ་གཅོད་པ་དང་། ཚིག་ཀྱལ་པ་དང་། གནོད་སེམས་དང་། ཆགས་སེམས་དང་། ལོག་པར་ལྟ་བ་དང་། མུ་གེ་དང་། ཆར་མི་འབབ་པ་དང་། རྐུན་པོ་དང་། ལྕགས་སྒྲོག་དང་།
en: In that buddha realm, those who are born with female bodies do not engage in sexual activity, and that buddha realm is free from quarrels, conflicts, lies, falsehood, slander, harsh words, idle gossip, ill will, attachment, wrong views, famine, drought, thieves, iron and wooden shackles, leg chains, improper pursuits, and actions that cause permanent damage to others.

source: ཤིང་སྒྲོག་དང་། རྐང་སྒྲིལ་དང་། མ་རུངས་པར་ཚོལ་བ་དང་། རྟག་ཏུ་གཞན་ལ་གནོད་པར་བྱེད་པ་དང་བྲལ་བ་སངས་རྒྱས་ཀྱི་ཞིང་དེར་རབ་ཏུ་ཞི་བར་འགྱུར་རོ། །
en: It is completely peaceful in that buddha realm.

source: གང་གི་ཚེ་བདག་དགའ་ལྡན་གྱི་ཁང་པར་འཇུག་པར་བྱ་ཞིང་དེ་ན་ཟླ་བ་བཅུ་མའི་མངལ་ན་གནས་པའི་ཚེ། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་མངོན་པར་ཤེས་པ་རྣམ་པར་རྩེ་བར་འགྱུར་ཞིང་ཐམས་ཅད་ཀྱང་སྔོན་བྱས་པའི་དགེ་བའི་རྩ་བ་རྗེས་སུ་དྲན་པར་འགྱུར་རོ། །
en: When I enter the Tuṣita palace and reside in my mother’s womb for ten months, beings will revel in the supernormal faculties everywhere in that buddha realm, and they will all remember the roots of virtue they have created before.

source: ནམ་བདག་ཟླ་བ་བཅུ་འདས་ནས་མའི་མངལ་ནས་བྱུང་བ་དེ་ན་བྱང་ཆུབ་ལ་ཞག་བདུན་པ་བདུན་གྱི་བར་དུ་སྤྱོད་པར་བྱའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་དེ་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱའོ། །
en: After ten months have passed and I have emerged from my mother’s womb, I will engage in activities for seven weeks and ripen all the beings of that buddha realm.

source: ཇི་ལྟར་བྱ་དང་རི་དགས་ཀྱི་བར་དུ་ཡང་རྒ་ཤི་ཐམས་ཅད་ལ་སྐྱོ་བས་མི་བཟད་པའི་བརྟུལ་ཞུགས་དང་། ཡོན་ཏན་ཡང་དག་པར་སྤྱོད་ཅིང་དཀའ་ཐུབ་ཀྱི་ནགས་ཚལ་དུ་མངོན་པར་ཆགས་པའི་སེམས་སུ་འགྱུར་རོ། །
en: All the beings including the birds and the wild animals will become weary of old age and death, so they will engage in intense observances and practice virtue, and their minds will be drawn to the forest of the ascetics.

source: གང་གི་ཚེ་བདག་ཞག་བདུན་པ་བདུན་ལས་འདས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱ་བར་བྱ་བ་ཞག་དེ་ཉིད་ལ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་བྱའོ། །
en: After those seven weeks have passed, on the day I attain unsurpassed and perfect buddhahood, I will turn the wheel of Dharma.

source: ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་དེ་ལ་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གྲངས་མེད་མཐའ་ཡས་མུ་མེད་པ་ཐེག་པ་གསུམ་གྱིས་ཡོངས་སུ་སྨིན་པར་བྱའོ། །
en: When I turn the wheel of Dharma, I will ripen countless myriads of beings using the three vehicles.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ན་ལྷ་ཐམས་ཅད་ལ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་བསྟན་པར་བྱའོ། །
en: I will display the turning of the wheel of Dharma to all the gods throughout that entire buddha realm.

source: གླིང་ཐམས་ཅད་ན་སེམས་ཅན་རྣམས་བཟོད་པ་དང་།
en: I will cause beings on every continent to be adorned with acceptances, absorptions, and dhāraṇīs.

source: ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱིས་བརྒྱན་པར་བྱ་བ་ནས་གླིང་ཐམས་ཅད་དུ་ཞག་བདུན་པ་བདུན་གྱི་བར་དུ་སེམས་ཅན་རྣམས་ལ་ཆོས་བསྟན་པར་བྱའོ། །
en: I will teach the Dharma to the beings on every continent for seven weeks.

source: གང་གི་ཚེ་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་སེམས་ཅན་བྱོལ་སོང་གི་སྐྱེ་གནས་ཅན་ཐམས་ཅད་བྱོལ་སོང་གི་སྐྱེ་གནས་ལས་ཡོངས་སུ་ཐར་བར་འགྱུར་ཞིང་མིའི་འཇིག་རྟེན་ཐོབ་པར་འགྱུར་རོ། །
en: I will free the animals in that buddha realm from their animal births and make them reach the human world.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་དེ་དག་ལ་བདག་ཉི་མ་བདུན་པ་བདུན་དུ་ཏིང་ངེ་འཛིན་དང་གཟུངས་དང་།
en: I will teach the beings in that buddha realm the absorptions, dhāraṇīs, and acceptances for seven weeks, so none of them will be reborn in the animal realms or in the world of the Lord of Death anymore.
